Repository: tuurek/hel-fi-drupal-grants
Catalog: public/themes/custom/helfi_grant_applications/translations/*.po
Languages: fi

source: Application
fi: Hakemus

source: Here you can see details of your application
fi: Tässä näet hakemuksesi yksityiskohdat

source: Add a file
fi: Lisää tiedosto

source: Current
fi: Tämänhetkinen

source: Completed
fi: Valmis

source: Application number
fi: Hakemusnumero

source: Print filled form
fi: Tulosta täytetty hakemus

source: Application info
fi: Hakemuksen tiedot

source: Summary about your application and processing details.
fi: Yhteenveto hakemuksesi perustiedoista ja käsittelytilasta

source: Sent date
fi: Lähetyspäivänmäärä

source: Handler information
fi: Käsittelijän tiedot

source: Application statuses
fi: Hakemuksen tila

source: Application attachments
fi: Hakemuksen liitteet

source: Search for application
fi: Etsi avustusta

source: Filter search
fi: Rajaa hakua
